Repository: 84000/data-translation-memory
Catalog: toh349-v4.tmx
Source language: bo
Languages: en

source: དཔལ་གྱི་སྡེའི་རྟོགས་པ་བརྗོད་པ།
en: The Account of the Noble Deeds of Śrīsena

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Three Jewels!

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་སྟེ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: When they were at Śrāvastī, the Blessed One said to the monks, “Monks, I know the fruits of generosity.

source: དགེ་སློང་དག་གལ་ཏེ་ཇི་ལྟར་ངས་སྦྱིན་པའི་འབྲས་བུ་ཡང་ཤེས་ལ་སྦྱིན་པའི་བགོ་བཤའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་ཤེས་བཞིན་དུ།
en: I also know how the fruits of generosity ripen. What if, like me, sentient beings too knew the fruits of generosity?

source: སེམས་ཅན་རྣམས་ཀྱིས་ཀྱང་སྦྱིན་པའི་འབྲས་བུ་ཡང་ཤེས་ལ་སྦྱིན་པའི་བགོ་བཤའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་ཤེས་སུ་ཟིན་ན་ནི་དེ་ལྟར་ན་ཁམ་གྱི་ཐ་མ་དང་ཁམ་གྱི་མཇུག་ལུས་པ་གང་ཡིན་པ་དེ་ལས་ཀྱང་གལ་ཏེ་ཡོན་གནས་ལེན་པ་པོ་རྙེད་ན། དེ་ལ་མ་བྱིན་ནམ་བགོ་བཤའ་མ་བྱས་ཀྱི་བར་དུ་ཟ་བར་མི་བྱེད་ལ།
en: What if, like me, they knew how the fruits of generosity ripen? Were this so and were someone to ask them for their last mouthful, the last remaining mouthful of their food, they would not eat it so long as they had not offered it or shared it.

source: དེ་དག་གི་སེམས་ཀྱང་སེར་སྣ་སྐྱེས་པས་ཀུན་ནས་དཀྲིས་ཤིང་འདུག་པར་མི་འགྱུར་བ་ཞིག་ན།
en: The growth of miserliness would not continue to completely entangle their minds.

source: ཇི་ལྟར་ངས་སྦྱིན་པའི་འབྲས་བུ་ཡང་ཤེས་ལ་སྦྱིན་པའི་བགོ་བཤའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་ཤེས་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱི་སྦྱིན་པའི་འབྲས་བུ་ཡང་མི་ཤེས་ལ་སྦྱིན་པའི་བགོ་བཤའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་མི་ཤེས་པས་ནི་དེའི་ཕྱིར་དེ་དག་ནི་ཀུན་དུ་འཛིན་པའི་སེམས་ཀྱིས་མ་བྱིན་པའམ།
en: I know the fruits of generosity. I also know how the fruits of generosity ripen. But unlike me, sentient beings do not know the fruits of generosity. Unlike me, they do not know how the fruits of generosity ripen. This ignorance is why their minds grasp at everything, why they are not generous, and why they eat without generosity.

source: བགོ་བཤའ་མ་བྱས་པར་ཟ་བར་བྱེད་ལ། དེ་དག་གི་སེམས་ཀྱང་སེར་སྣ་སྐྱེས་པས་ཀུན་ཏུ་དཀྲིས་ཤིང་འདུག་གོ།
en: The growth of miserliness continues to completely entangle their minds.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ།
en: This is what the Blessed One said.

source: བདེ་བར་གཤེགས་པས་དེ་སྐད་དུ་གསུངས་ནས། གཞན་ཡང་སྟོན་པས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བགོ་བཤའ་དག་གི་རྣམ་པར་སྨིན།
en: After the Well-Gone One had said this, the Teacher also said:

source: །ཇི་ལྟར་དོན་ཆེན་གྱུར་པ་དེ། །དྲང་སྲོང་ཆེ་རྣམས་གསུངས་པ་བཞིན།
en: “As the great sages have said, The ripening of sharing is a matter of great import.

source: །སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ན་ནི།
en: “Thus, if sentient beings knew about this,

source: །མ་བྱིན་བར་དུ་མི་ཟ་ཞིང་།
en: They would not eat so long as they could offer.

source: །སེར་སྣ་ཅན་དུ་མི་འགྱུར་ལ།
en: They would not be miserly,

source: །དེ་དག་ཀུན་དུ་འཛིན་པའི་སེམས། །ནམས་ཀྱང་སྐྱེ་བར་མི་འགྱུར་ན།
en: And never would they give rise to grasping minds.

source: །གང་ཕྱིར་བྱིས་པ་གཏི་མུག་གིས།
en: “But ignorance obscures immature beings.

source: །བསྒྲིབས་པ་རྣམས་ཀྱིས་མ་ཤེས་པས། །དེ་ཕྱིར་ཀུན་དུ་འཛིན་སེམས་ཀྱིས།
en: Since they do not know, their minds are grasping.

source: །རྟག་ཏུ་མ་བྱིན་ཟ་བར་བྱེད། །དེ་དག་སེར་སྣ་སྐྱེས་ནས་ཀྱང་།
en: Thus they always eat without first offering,

source: །སེམས་ནི་ཀུན་ནས་དཀྲིས་ཤིང་འདུག །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་མདོ་འདི་བཤད་པ་དེའི་ཚེ་ས་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཅིང་། བཅོམ་ལྡན་འདས་ཉིད་ཀྱི་སྐུ་ལས་འོད་ཟེར་རྣམས་བྱུང་བར་གྱུར་ཏོ།
en: They become miserly, and their minds are overcome.” When the Blessed One delivered this discourse, the earth shook in six different ways and light rays shone from the Blessed One’s body.

source: །དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་ཅིང་རྨད་དུ་བྱུང་བ་འདི་ལྟ་བུ་མཐོང་བ་ན་ངོ་མཚར་སྐྱེས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འདི་ལྟ་བུའི་རྨད་དུ་བྱུང་བའི་ཆོ་འཕྲུལ་སྟོན་པར་མི་མཛད་ན།
en: When the monks saw the Blessed One’s inconceivable and marvelous miracles, they were amazed and inquired of the Buddha, the Blessed One, “Honorable One, the thus-gone, worthy, perfect Buddha would not display such marvelous miracles without causes or conditions.

source: བཙུན་པ་འདི་ལྟ་བུའི་རྨད་དུ་བྱུང་བའི་ཆོ་འཕྲུལ་གྱི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: That being so, Honorable One, what are the causes and conditions of such marvelous miracles?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཆོ་འཕྲུལ་འདི་ལྟ་བུ་འདི་འབྱུང་བའི་རྒྱུ་ཉན་པར་འདོད་དམ། བཙུན་པ་དེ་ལྟར་འཚལ་ལོ།
en: “Monks, would you like to hear what caused a miracle like this?” asked the Blessed One.

source: །དགེ་སློང་དག་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་པར་བྱའོ།
en: The monks requested just this. Then the Blessed One replied, “Monks, if this is so, listen carefully, remember my words, and I will tell you.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རྒྱལ་པོའི་ཕོ་བྲང་ཨ་རིཥྛ་ཞེས་བྱ་བ་འབྱོར་པ་རྒྱས་པ་བདེ་བ་ལོ་ལེགས་པ། སྐྱེ་བོ་མང་པོ་དང་མིས་གང་བ།
en: “Monks, at one time there was a royal estate called Ariṣṭa. It was wealthy, vast, joyous, with good harvests, and full of people.

source: ཆུར་དཔག་ཚད་བཅུ་གཉིས། ཞེང་དུ་དཔག་ཚད་བདུན་པ། གྲུ་བཞི་པ། རྣམ་པར་འབྱེས་པ།
en: It was twelve leagues long and seven leagues wide. It was partitioned into quadrants.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རྟ་བབས་སྒྲེང་བ་ཞིག་བྱུང་བར་གྱུར་ཏེ།
en: Parasols, victory banners, and flags were erected over its archways.

source: རྒྱལ་པོའི་ཕོ་བྲང་དེར་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ཞེས་བྱ་བ་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བ།
en: “At this royal estate lived a king named Śrīsena, who was a universal monarch who ruled through force.

source: གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: He had a lovely physique, and was beautiful, pleasing to the eye, and had a good complexion.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ།
en: He possessed the best attributes in abundance.

source: རང་བཞིན་གྱིས་སྐྱེ་བ་དྲན་པ།
en: He could remember his past lives naturally, and he was righteous.

source: ཆོས་དང་ལྡན་པ། ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་ཀྱིས་འཛམ་བུའི་གླིང་གི་དབང་ཕྱུག་གི་བདག་པོ་བྱེད་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ།
en: He was a Dharma king who ruled Jambudvīpa through righteousness.

source: །རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་མཐུས་ཤིང་རྣམས་རྟག་ཏུ་མེ་ཏོག་དང་འབྲས་བུར་ལྡན་ཞིང་ལྷ་རྣམས་དུས་དུས་སུ་ཆར་ཡང་དག་པར་འབེབས་ལ། ལོ་ཏོག་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏོ།
en: “King Śrīsena’s power caused the plants to blossom and bear fruit continuously, the gods to make the rains fall at the right times, and the harvests to be exceedingly abundant.

source: །སེམས་ཅན་རྣམས་ཀྱང་ནད་མེད་པར་གྱུར་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཕན་ཚུན་བྱམས་པའི་སེམས་ཀྱིས་གནས་སོ།
en: The beings there were free from illness and they all maintained a loving attitude toward each other.

source: །རྒྱལ་པོ་དེའི་བཙུན་མོ་དམ་པ་རྒྱལ་བའི་འོད་ཅེས་བྱ་བ་གཟུགས་བཟང་བ།
en: “The king’s noble queen was called Jayaprabhā.

source: མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: She had a lovely figure and was beautiful and pleasing to the eye.

source: ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཚང་བ།
en: She had all her major and minor body parts.

source: ཡུལ་གྱི་བཟང་མོ་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་ཤིན་ཏུ་ཡིད་དུ་འོང་བ་དང་། སྡུག་པ་དང་། ཕངས་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ།
en: She was the perfect daughter of that land, and King Śrīsena loved, adored, and cherished her.

source: །དགེ་སློང་དག་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ལ་དཔྱ་དང་ཤོ་གམ་དང་གྲུ་བཙས་མེད་དེ།
en: “Monks, King Śrīsena levied no taxes on any of Jambudvīpa’s people; he collected neither road tolls nor boat fares. The harvests made all the people wealthy, and they were peaceful.

source: ཞིང་གི་འབྱོར་པ་དང་ལྡན་པ། སྐྱེ་བོ་རྣམས་ཞི་བ། ཁྱིམ་བྱ་རྣམས་དང་ལྡན་པའི་ཡུལ་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་བྱུང་བར་གྱུར་ཏོ།
en: Families filled the lands, cities, towns, countryside, and the king’s estate.

source: །དགེ་སློང་དག་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཏེ། ཐམས་ཅད་སྟེར་བ། ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ།
en: “Monks, King Śrīsena was a bodhisattva, so he gave away everything. He let go of everything completely—indeed, he let go of everything completely and without attachment.

source: ཆགས་པ་མེད་པར་ཡོངས་སུ་གཏོང་བ་དང་། གཏོང་བ་ཆེན་པོ་ལ་ཞུགས་ནས་ཐ་ན་རང་གི་ཤ་ཡང་གཏོང་སྟེ།
en: Absorbed in great giving, he even gave away his own flesh.

source: དེས་མ་བྱིན་པ་དང་། ཡོངས་སུ་མ་བཏང་བ་ཅི་ཡང་མེད་དོ།
en: There was nothing that he would not give away or let go.

source: །དགེ་སློང་དག་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་རྒྱལ་པོའི་ཕོ་བྲང་ཨ་རིཥྛའི་ཤར་ཕྱོགས་ཀྱི་གྲོང་ཁྱེར་མཐར་སྦྱིན་གཏོང་གི་གནས་བྱས་ཏེ། སྦྱིན་པ་ནི་གཏོང་། བསོད་ནམས་ནི་བྱེད་དོ།
en: “Monks, at the eastern edge of the city, at Ariṣṭa Estate, King Śrīsena created a site for gift offerings from which he distributed gifts and performed meritorious deeds.

source: །ལྷོ་དང་ནུབ་དང་བྱང་གི་གྲོང་ཁྱེར་གྱི་སྒོར་སྦྱིན་པ་ནི་གཏོང་། བསོད་ནམས་ནི་བྱེད་དོ། །སུམ་མདོའི་དབུས་ན་ཡང་སྦྱིན་པ་ནི་གཏོང་། བསོད་ནམས་ནི་བྱེད་དོ། །འདི་ལྟ་སྟེ།
en: He distributed gifts and performed meritorious deeds at the city’s southern, western, and northern gates as well, and he distributed gifts and performed meritorious deeds at its intersections.

source: ཟས་འདོད་པ་རྣམས་ལ་ནི་ཟས། སྐོམ་འདོད་པ་རྣམས་ལ་ནི་སྐོམ།
en: He would, for example, give food to the hungry and drink to the thirsty.

source: བཟའ་བ་དང་། བཅའ་བ་དང་། མར་མེ་དང་། ཕྲེང་བ་དང་། དྲི་དང་། བྱུག་པ་དང་། གོས་དང་། མལ་ཆ་དང་། སྟན་དང་། རྒྱབ་རྟེན་དང་། གནས་དང་། གཟུགས་རྣམས་དང་། ཤིང་རྟ་དང་། གླང་པོ་དང་། རྟ་དང་། རྒྱན་རྣམས་དང་། གསེར་གྱི་སྣོད་དངུལ་གྱི་ཕྱེ་མས་ཡོངས་སུ་གང་བ་རྣམས་དང་། དངུལ་གྱི་སྣོད་གསེར་གྱི་ཕྱེ་མས་ཡོངས་སུ་གང་བ་རྣམས་དང་། བ་ལང་གསེར་གྱི་རྭ་དང་། དངུལ་གྱི་རྨིག་པ་བཏགས་པ། ཁར་བའི་བཞོ་སྣོད་དང་། རས་ཟུང་གིས་བཀབ་པ་རྣམས་དང་། གཞོན་ནུ་མ་རྣམས་དང་། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ནས་སྦྱིན་པ་ནི་གཏོང་། བསོད་ནམས་ནི་བྱེད་དེ།
en: He distributed gifts and performed meritorious deeds by giving food, drink, lamps, flower garlands, scents, perfumes, clothes, blankets, mattresses, back supports, shelters, images, horse-carts, elephants, horses, ornaments, golden containers filled with silver dust, silver containers filled with gold dust, oxen with golden horns and silver hoofs, bronze milking containers that were twice covered with cloth, and maidens who were adorned with various ornaments.

source: དགེ་སློང་དག་ཇི་ཙམ་དུ་རྒྱལ་པོ་དཔལ་གྱི་སྡེས་ཅི་ཙམ་གྱིས་འཛམ་བུའི་གླིང་པའི་མི་ཐམས་ཅད་ཕྱུག་པ་དང་། ནོར་མང་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་གྱུར་པ་དེ་ཙམ་དུ་སྦྱིན་པ་རྣམས་བྱིན་ནོ།
en: “Monks, King Śrīsena gave gifts until everyone in Jambudvīpa was affluent, prosperous, and deeply contented.

source: །ཡང་དེའི་ཚེ་རྒྱལ་པོའི་ཕོ་བྲང་ཨ་རིཥྛའི་གྲོང་ཁྱེར་ན་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་གི་མི་རྣམས་གནས་ཏེ།
en: At that time, 960 million people lived in the city where the king’s royal estate, Ariṣṭa, was located.

source: རྒྱལ་པོ་དཔལ་གྱི་སྡེ་དེ་དག་ཐམས་ཅད་ཀྱི་སྡུག་པ་དང་ཡིད་དུ་འོང་བར་གྱུར་ཏོ།
en: King Śrīsena was loved and adored by all.

source: །གཞན་ཡང་འདི་སྐྱེས་པ་དང་བུད་མེད་རྣམས་ཀྱིས་མཐོང་བ་ན་ངོམས་པར་མི་འགྱུར་བའི་དགའ་བ་ཐོབ་བོ།
en: What was more, when men and women saw him, they experienced insatiable delight.

source: །དགེ་སློང་དག་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་བློན་པོ་སྟོང་ཕྲག་བཅུ་གཉིས་ཡོད་དེ།
en: “Monks, King Śrīsena had twelve thousand ministers.

source: བློན་པོ་དེ་རྣམས་ཀྱི་མཆོག་བློ་གྲོས་ཆེན་པོ་ཞེས་བྱ་བ་མཁས་པ།
en: The supreme one among them was called Mahāmati.

source: གསལ་བ། བློ་དང་ལྡན་པ། ཐམས་ཅད་ལ་དབང་བྱེད་པ། རྒྱལ་པོ་ཡོངས་སུ་སྐྱོང་བར་བྱེད་པ།
en: He was learned, bright, wise, his charisma affected all, and he took great care of the king.

source: རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་སྡུག་པ་དང་ཡིད་དུ་འོང་བ་དང་། ཕངས་པར་གྱུར་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ།
en: King Śrīsena loved, adored, and esteemed him.

source: །དེས་འདིའི་གཟུགས་དང་། ཁ་དོག་དང་། རྟགས་དང་། དབྱིབས་མཐོང་བ་ན་ངོམས་པ་མེད་དེ།
en: Mahāmati would never tire of gazing upon the king’s form, his complexion, his features, or his shape.

source: སྐད་ཅིག་ཀྱང་འདི་དང་མི་འབྲལ་ལོ།
en: He could not be separated from the king for even a moment.

source: །དགེ་སློང་དག་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ཡང་དག་པར་སྦྱར་ཏེ།
en: “Monks, King Śrīsena acquainted all of Jambudvīpa’s people with the path of the ten virtuous actions.

source: ཤེས་ལྡན་དག་འཛམ་བུའི་གླིང་གི་མི་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ལ་རྟེན་ཅིག །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་རྣམས་ཡང་དག་པར་ཟུང་ཤིག་ཅེས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ཡང་དག་པར་སྦྱོར་ཏེ། དགེ་སློང་དག་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་དེ་ལྟ་བུའི་གདམས་ངག་རྗེས་སུ་སྟོན་པར་གྱུར་ཏོ།
en: He said to them, ‘People of Jambudvīpa, you must follow the path of the ten virtuous actions. You must adopt the path of the ten virtuous actions correctly.’ Monks, this is how King Śrīsena instructed his subjects.

source: །འདི་ལྟ་སྟེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དེའི་དུས་སུ་གང་འཛམ་བུའི་གླིང་པའི་མི་གང་ལ་ལ་དུས་བྱས་ཏེ་ལུས་ཞིག་ནས་དེ་ལྷའི་རིས་དྲུག་ཏུ་སྐྱེ་བར་གྱུར་ཏོ།
en: Thus, during the reign of this universal monarch, when people in Jambudvīpa would die and their bodies would perish, they were reborn in one of the six god realms.

source: །གང་ཕལ་ཆེར་ནི་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་རིས་སུ་སྐྱེས་སོ། །ཡང་དེའི་ཚེ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་ལྷའི་གྲོང་ཁྱེར་བལྟ་ན་སྡུག་ཅེས་བྱ་བ་ལྷའི་ཚོགས་ཀྱིས་ཀུན་ཏུ་གང་ངོ་།
en: Most were born in the Heaven of the Thirty-Three, and the divine city Darśanīya was filled with crowds of gods from the Heaven of the Thirty-Three.

source: །དེ་ནས་དེར་གོ་སྐབས་མེད་པར་གྱུར་པ་དང་། བལྟ་ན་སྡུག་གི་ཕྱི་རོལ་ཡོངས་འདུ་དང་། ཤིང་རྟ་སྣ་ཚོགས་ཅན་དང་། དགའ་བའི་ཚལ་ལ་སོགས་པའི་སྐྱེད་མོས་ཚལ་རྣམས་སུ་གནས་པར་གྱུར་ཏོ།
en: When it became too crowded and there was not enough space in the divine city, the gods dwelled on the outskirts of Darśanīya at the Pārijāta and in groves such as Caitraratha, Nandanavana, and so forth.

source: །དེ་ནས་སྔོན་སྐྱེས་པའི་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་ཚོགས་ཀྱིས་ཡང་དག་པའི་འབྱོར་པ་དེ་མཐོང་སྟེ། རབ་ཏུ་དགའ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Following this influx, the gods who had been born earlier in the Heaven of the Thirty-Three viewed the perfect accomplishments of the newcomers and were overjoyed. They spoke to Śakra, lord of the gods, saying,

source: །ཀཽ་ཤི་ཀ་གང་དུ་རིའི་རྒྱལ་པོ་རི་རབ་དེ་ཉིད་ལྷའི་བུ་དེ་དག་གིས་གང་སྟེ་ལྷའི་ཚོགས་ནི་འཕེལ་བར་གྱུར།
en: ‘Kauśika, how is it that Mount Sumeru is filled with gods, and the divine assembly has increased, while the demigods’ assembly has decreased?

source: ལྷ་མ་ཡིན་གྱི་ཚོགས་ནི་འགྲིབ་པར་གྱུར་པའི་ངོ་མཚར་འདི་ལ་གཟིགས་སོ།
en: We are beholding something marvelous.’

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ལྷའི་བུ་རྣམས་ལས་ཐོས་ནས་རིའི་རྒྱལ་པོ་རི་རབ་ཐམས་ཅད་ལ་བལྟ་བར་བརྩམས་པ་དང་། ཇི་ཙམ་ན་རིའི་རྒྱལ་པོ་རི་རབ་ལྷའི་ཚོགས་རྣམས་ཀྱིས་ཀུན་ནས་གང་བ་མཐོང་ངོ་།
en: “After hearing about this from the gods, Śakra, lord of the gods, inspected Mount Sumeru, and as soon as he did, he too saw that Mount Sumeru was teeming with multitudes of gods.

source: །མཐོང་ནས་ཀྱང་འདི་སྙམ་དུ་སེམས་ཏེ། རྒྱུ་གང་དང་རྐྱེན་གང་གིས་སེམས་ཅན་འདི་སྙེད་ཅིག་འདིར་སྐྱེས་པར་གྱུར་སྙམ་ནས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ལ་བལྟ་བར་བརྩམས་པ་དང་། ཇི་ཙམ་ན་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་མཐུ་ཡིན་པར་མཐོང་ངོ་།
en: Seeing this, he thought, ‘What causes and conditions led this many sentient beings to be born here?’ With this in mind, he began to inspect all of Jambudvīpa, and as soon as he did, he saw that it was a result of King Śrīsena’s influence.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སེམས་རབ་ཏུ་དགའ་བས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ལ་སྨྲས་པ།
en: Then, with great joy, Śakra, lord of the gods, said to the gods of the Heaven of the Thirty-Three:

source: གྲོགས་པོ་དག་ཁྱེད་རྣམས་ཉོན་ཅིག །འཛམ་གླིང་དབང་ཕྱུག་རྒྱལ་པོ་ནི།
en: “ ‘Friends, you must listen! There is a king, a ruler of Jambudvīpa,

source: །དཔལ་གྱི་སྡེ་ཞེས་རྣམ་གྲགས་པ།
en: Who is renowned as Śrīsena.

source: །རྟག་ཏུ་ཆོས་ལ་གཞོལ་བ་དང་། །རྒྱལ་པོ་ཆེན་པོ་ཆོས་ལ་གནས།
en: He is always inclined toward the Dharma. “ ‘This great king lives by the Dharma.

source: །ཐོག་མ་བར་དང་མཐར་དགེ་ཞིང་།
en: In the beginning, middle, and end, he is always virtuous.

source: །སེམས་ཅན་ཀུན་ལ་ཕན་པར་དགའ།
en: He delights in helping all sentient beings

source: །གཙོ་བོ་མི་རྣམས་དགེ་བ་ལ། རྟག་ཏུ་ཡང་དག་སྦྱོར་བར་བྱེད།
en: And, principally, he continually brings humans to virtue.

source: །རྟག་ཏུ་སྙིང་རྗེའི་བདག་ཉིད་ཅན།
en: “ ‘He is constantly compassionate,

source: །ཕྱི་རོལ་དངོས་པོ་རབ་གཏོང་ཞིང་།
en: He gives away his external possessions,

source: །དེ་ནི་ཤ་ཡང་སློང་བ་ལ།
en: And to those who ask for his flesh,

source: །རྗེས་སུ་བརྩེ་བ་ཉིད་ཀྱིས་སྟེར།
en: He gives this away too, with love.

source: །ནང་ངམ་ཡང་ན་ཕྱི་རོལ་ལ།
en: “ ‘Whether that which is asked for is external or internal,

source: །དེ་ནི་ཡོངས་སུ་འཛིན་མེད་པར།
en: Without any sense of grasping

source: །རྗེས་བརྩེ་ཉིད་ཀྱི་གཏོང་བྱེད་ཅིང་།
en: He bestows everything with kindness

source: །བྱང་ཆུབ་མཐར་དབྱུང་བ་ལ་བརྩོན།
en: And works diligently to achieve awakening.

source: །དེས་ནི་རྣམ་དག་གསེར་བཞིན་དུ།
en: “ ‘Like refined gold,

source: །འགྲོ་བ་ཐམས་ཅད་རབ་བསྒྲུབས་པས།
en: He accomplishes the wishes of all beings.

source: །རྒྱལ་པོ་དེ་ཡི་མཐུ་ཡིས་ནི།
en: Through the encouragement of this king

source: །ཐམས་ཅད་མཐོ་རིས་ལ་གཞོལ་འགྱུར།
en: Everyone is inspired to pursue higher rebirths. “ ‘Because of the influence

source: །རྒྱལ་པོ་བློ་གྲོས་ཆེ་དེ་ཡི།
en: Of this great, intelligent king

source: །མཐུ་ཡིས་སུ་ཡང་དམྱལ་བ་དང་། །ཡི་དགས་དང་ནི་དུད་འགྲོ་ཡི།
en: No one will be born in hell, In the preta realm, or the animal realm.

source: །སྐྱེ་གནས་རྣམས་སུ་སྐྱེ་མི་འགྱུར། །དེ་ཡི་གཟི་བརྗིད་མཐུ་ཡིས་ནི།
en: “ ‘This king’s resplendent radiance Illuminates their migrations.

source: །ཐམས་ཅད་སྣང་བར་འགྲོ་བ་དང་། ། སྦྱིན་དང་ཚུལ་ཁྲིམས་དགའ་འགྱུར་བར། །དགའ་བའི་ཚལ་ན་དགའ་བས་རྩེ།
en: They take joy in giving and discipline, And they play joyfully in Nandanavana.

source: །དཔལ་གྱི་སྡེ་ལ་རྗེས་བསྟེན་པར།
en: “ ‘Those who follow Śrīsena

source: །གུས་དང་བཅས་པར་གྱུར་པ་འདི།
en: Are respectful and live

source: །ལྷ་ཡི་འཇིག་རྟེན་ཉམས་དགའ་བར།
en: In pleasurable divine worlds,

source: །དེ་ཡང་དགའ་བས་རྣམ་པར་སྣང་།
en: Where they shine with joy.’

source: །དེ་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་དེ་རྣམས་ཀྱིས་ཚིག་དེ་ཐོས་པ་དང་ཡིད་དགའ་བ་དང་། སེམས་རངས་པར་གྱུར་ཏེ། དགའ་བའི་སེམས་སུ་གྱུར་ཅིང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “When the gods of the Heaven of the Thirty-Three heard these words, their minds were overjoyed, and they celebrated.

source: །གང་རྒྱལ་པོ་འདི་ཡན་ལག་དང་ཉིང་ལག་ཀྱང་སྦྱིན་པར་གཏོང་འདོད་པར་རྩོལ་བ་ནི་ངོ་མཚར་ཆེའོ།
en: With such joy in their minds, they exclaimed, ‘This king aspires to fulfill his wish to give away his major and minor body parts—this is marvelous!

source: །འོན་ཀྱང་འདི་ལྟར་ཡན་ལག་དང་ཉིང་ལག་སྟེར་བ་འདི་ནི་དཀའ་བ་སྟེ།
en: Yet it is difficult to give away one’s major and minor body parts.

source: བདག་དང་མཉམ་པར་ཕངས་པ་གཞན་མེད་པས་དེ་ཇི་ལྟར་ན་བདག་ཉིད་ཆེན་པོ་འདི་རང་གི་ལུས་ཀྱི་སྡུག་བསྔལ་བ་ལ་མི་སེམས་པར་ཡན་ལག་དང་ཉིང་ལག་སྦྱིན་པར་གཏོང་བར་གྱུར་ཏེ། འདི་ནི་རྗེས་སུ་དཔག་པར་ནུས་པ་མ་ཡིན་ནོ།
en: Since there is no one as dear as oneself, he will not be able to give away his major and minor body parts without concern for his own suffering. This act of giving is not something that one can simply infer.’

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། གྲོགས་པོ་དག་ཁྱེད་རྣམས་དེ་སྐད་མ་སྨྲ་ཤིག །རྒྱལ་པོ་འདི་ནི་མཐུ་ཆེ་སྟེ་རྫུ་འཕྲུལ་ཆེ་བ།
en: “ ‘Friends,’ replied Śakra, ‘do not say these things! This king is powerful.

source: སྙིང་རྗེ་ཆེ་བས་ཐ་ན་རང་གི་ཤ་ཡང་གཏོང་སྟེ།
en: He has magical powers and intense compassion. This is why he can give away even his own flesh.

source: འདི་ལ་ཡོངས་སུ་མ་བཏང་བ་ཅི་ཡང་མེད་དོ།
en: There is nothing that he cannot relinquish.’

source: །ཇི་ཙམ་ན་དུས་གཞན་ཞིག་གི་ཚེ་བཙུན་མོ་རྒྱལ་བའི་འོད་སྟན་ཆེན་པོ་ལ་ཉལ་བ་ན་ཐོ་རངས་ཀྱི་དུས་སུ་རྨི་ལམ་བཞི་རྨིས་ཏེ།
en: “Shortly thereafter, on another occasion, Śrīsena’s queen, Jayaprabhā, went to sleep on her large mattress, and just before dawn she dreamt four dreams. First, she dreamt that Śrīsena carried her down off the mattress and then lifted her back onto it.

source: དཔལ་གྱི་སྡེ་སྟན་ལས་བདག་ཉིད་ཕབ་ནས་སླར་ཡང་བཏེག་པར་མཐོང་བ་དང་། རང་གི་མིག་ཕྱུང་སྟེ་སླར་ཡང་སྐྱེས་པར་མཐོང་བ་དང་། བདག་ཉིད་ཀྱི་དཔུང་པ་གཡས་པ་འདི་བཅད་དེ་ས་ལ་ལྷུང་བ་ཡང་སྐྱེས་པར་མཐོང་བ་དང་། མི་མ་ཡིན་པ་དངུལ་གྱི་རྡོ་བཅག་པའི་མདོག་འདྲ་བ་ཞིག་གིས་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་དཔུང་པ་གཡོན་པ་མོད་ལ་ཕྱུང་སྟེ།
en: Then he gouged out his own eyes, but they were later restored. He chopped off his right arm, which fell to the ground, but it was also restored. Finally, she dreamt of a nonhuman that resembled a stone grinder, made from silver. It suddenly pulled off King Śrīsena’s left arm.

source: ཕྲོགས་ནས་སླར་ཡང་སྐྱེ་བར་རྨིས་སོ།
en: After it was thus stolen, however, that too was restored.

source: །གཉིད་སད་པ་དང་འཇིགས་པར་གྱུར། དངངས་པར་གྱུར།
en: Then she woke up. Filled with fear, she gasped and the hairs on her body stood on end.

source: སྤུ་ཟིང་ཞེས་བྱེད་དེ། ངའམ་ལྷ་ལ་སྡུག་བསྔལ་འབའ་ཞིག་འབྱུང་བར་མི་འགྱུར་གྲང་ཞེས་བསམས་ནས། དེས་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ལ་སྨྲས་སོ། །
en: She thought, ‘Either the lord or I will experience nothing but suffering.’ She told King Śrīsena of her dreams.

source: དེ་རྨི་ལྟས་ལ་བྱང་བ་ཡིན་པས་འདི་སྙམ་དུ་སེམས་ཏེ། འདིས་རྨི་ལམ་ཇི་ལྟ་བུ་མཐོང་བ་ལས་ན་རིང་པོ་མི་ཐོགས་པར་ཆུང་མ་འདི་ཉིད་སློང་བ་འབྱུང་བར་འགྱུར་རོ་སྙམ་ནས་སྨྲས་པ། མ་འཇིགས་ཤིག །སྒྱུ་མ་ལྟ་བུ་རྨི་ལམ་ལ་སེམས་པས་ཅི་ཞིག་བྱ།
en: He had been trained to interpret dreams, so he thought, ‘As she has seen in her dream, someone will soon come to ask for my wife.’ But he comforted her and said, ‘Do not be afraid—what is the point of thinking about illusion-like dreams?

source: དཔལ་གྱི་སྡེ་སྟན་ལ་བདག་ཉིད་གནས་པར་ཁྱོད་ཀྱིས་མ་མཐོང་ངམ།
en: Do you not see Śrīsena sitting on his mattress?

source: མིག་མི་ཉམས་པར་དེ་བཞིན་དུ་འདུག་པ་དང་། བདག་ཉིད་ཀྱི་དཔུང་པ་གཡས་པ་དེ་བཞིན་དུ་ཡོད་པ་དང་། ངའི་ཡང་དཔུང་པ་གཡོན་པ་གནས་བཞིན་པ་ཉིད་ཅེས་དེས་དབུགས་ཕྱུང་བ་དང་། ཅང་མི་སྨྲ་བར་འདུག་གོ།
en: My eyes are as they were, and my right and left arms are intact.’ The queen sat silently.

source: །ཇི་ཙམ་ན་མཚན་མོ་གཉིས་པ་ལ་བློན་པོའི་མཆོག་བློ་གྲོས་ཆེན་པོ་ཞེས་བྱ་བའི་རྨི་ལམ་དུ་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་པའི་ཁང་བཟངས་མོད་ལ་ཞིག་པ་དང་། རིན་པོ་ཆེ་དེ་རྣམས་ཤ་ཟ་མཐོང་ན་འཇིགས་སུ་རུང་བ་རྣམས་ཀྱིས་ཕན་ཚུན་ཁྱེར་བ་དང་། སླར་ཡང་ཁང་བཟངས་སོ་སོར་སྦྱར་བར་རྨིས་སོ།
en: “The second night after this, the supreme one among the ministers, the one named Mahāmati, dreamt a dream in which King Śrīsena’s mansion, which was built of various precious stones, collapsed. The precious stones were then taken away by fearful-looking demons. Later, however, he dreamt that the mansion was rebuilt.

source: །སད་པ་དང་འཇིགས་ཤིང་སྐྲག་པ་དང་། ཡི་མུག་སྟེ་སྤུ་ཟིང་ཞེས་བྱེད་པ་དང་།
en: He awoke terrified and distressed, with the hairs on his body standing on end.

source: བསམས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པ་དང་། ལྷ་དཔལ་གྱི་སྡེའི་སྐུ་ལུས་སློང་བར་མི་འགྱུར་གྲང་། ལྷ་ཡང་ཐམས་ཅད་སྩོལ་བ། ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ། ཆགས་པ་མེད་པར་གཏོང་སྟེ། འདི་ལྟ་སྟེ་དམན་པ་དང་། ལོང་བ་དང་། བཀྲེན་པ་དང་། སྡུག་ཕོངས་པ་རྣམས་ལ་འདི་ཡོངས་སུ་མི་གཏོང་བ་ཅི་ཡང་མེད་དོ།
en: He thought, ‘Could someone come to ask for Lord Śrīsena’s body? Could they ask for the body of he who pleases and is affectionate toward all sentient beings, the lord who offers everything, who gives everything completely, he who gives without attachment? There is nothing that he would not give to lesser, blind, hungry, suffering, and deprived beings.

source: །རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ལ་ནི་ཞུ་བར་མི་བྱ་སྟེ། ཤིན་ཏུ་སྤྲོ་བ་སྐྱེ་བར་མི་འགྱུར་གྲང་།
en: I will not speak of my dream to King Śrīsena. He would be too delighted about it!’

source: དེ་ནས་དེས་གསང་སྟེ་མཚན་མཁན་བོས་ནས་དམ་བསྒོ་སྟེ་ཞེས་སྨྲས་པ། ཤེས་ལྡན་ངས་འདི་ལྟ་བུའི་རྨི་ལམ་རྨིས་པའི་འབྲས་བུ་ཇི་ལྟ་བུར་འགྱུར་བ་ཁྱོད་ཀྱིས་ལུང་སྟོན་ཅིག །མཚན་མཁན་གྱིས་སྨྲས་པ། རྨི་ལམ་ཅི་འདྲ་བ་འདི་ལས་རིང་པོ་མི་ཐོགས་པར་ལྷའི་སྐུ་ལུས་སློང་བ་འོང་བར་འགྱུར་རོ།
en: “He then called a soothsayer and commanded him, ‘Wise one, you must foretell the significance of the dream that I had.’ The soothsayer said, ‘According to the dream, someone will come soon to ask for the lord’s body.’
